app/controllers/comments_controller.rb

    def set_post
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "hassy"], ["body", "test de before ection\r\n"], ["article_id", 3], ["created_at", "2021-07-14 14:38:52.038404"], ["updated_at", "2021-07-14 14:38:52.038404"]]